[
    {
        "name": "en164-1.pdf",
        "title": "Middle Discourses (Majjhimanikāya) - Volume 1",
        "description": "Volume 1 of the Middle Discourses (Majjhimanikāya), translated by Bhikkhu Sujato, serves as an introduction to the core teachings of the Buddha. This volume presents the foundational discourses that outline the principles of ethical conduct (Sīla), mental cultivation (Samādhi), and wisdom (Paññā). Through practical and insightful dialogues, the Buddha discusses the nature of suffering, the path to liberation, and the importance of mindfulness in daily life. With clarity and compassion, these teachings offer a profound understanding of how to live in harmony with oneself and the world, paving the way toward spiritual growth.",
        "resourceTag": "Middle Discourses",
        "tags": []
    },
    {
        "name": "en164-2.pdf",
        "title": "Middle Discourses (Majjhimanikāya) - Volume 2",
        "description": "Volume 2 of the Middle Discourses (Majjhimanikāya) continues the exploration of the Buddha's profound teachings on mindfulness and wisdom. This collection dives deeper into the practical applications of meditation, self-reflection, and the cultivation of inner peace. The Buddha's dialogues illuminate the understanding of impermanence (Anicca), non-self (Anattā), and the nature of reality. Through these teachings, practitioners are guided on how to detach from suffering and embrace a path of compassion and clarity, progressing towards enlightenment with mindful awareness.",
        "resourceTag": "Middle Discourses"
    },
    {
        "name": "en164-3.pdf",
        "title": "Middle Discourses (Majjhimanikāya) - Volume 3",
        "description": "Volume 3 of the Middle Discourses (Majjhimanikāya) marks the final step in the journey through the Buddha's essential teachings. This volume focuses on liberation (Vimutti), the realization of truth (Dhamma), and the path to ultimate enlightenment (Nibbāna). The Buddha addresses the obstacles to spiritual awakening, offering guidance on overcoming ignorance and attachment. Rich with dialogues and practical insights, this collection is a beacon for those committed to achieving spiritual freedom and understanding the true nature of existence.",
        "resourceTag": "Middle Discourses",
        "tags": []
    },
    {
        "name": "en163-1.pdf",
        "title": "Long Discourses (Dīgha Nikāya) - Volume 1",
        "description": "Volume 1 of the Long Discourses (Dīgha Nikāya), translated by Bhikkhu Sujato, opens the gateway to some of the Buddha's most extensive teachings. This volume includes detailed dialogues that explore the nature of reality, ethical conduct, and the path to spiritual liberation. Through captivating narratives and philosophical discussions, the Buddha explains fundamental concepts such as Karma, Rebirth, and the structure of the cosmos. These discourses also provide practical guidance on meditation and the cultivation of wisdom, offering timeless insights for both practitioners and scholars of Buddhism.",
        "resourceTag": "Long Discourses",
        "tags": []
    },
    {
        "name": "en163-2.pdf",
        "title": "Long Discourses (Dīgha Nikāya) - Volume 2",
        "description": "Volume 2 of the Long Discourses (Dīgha Nikāya) continues the profound journey into the Buddha's teachings. This volume highlights discourses on the principles of right view, the practice of mindfulness, and the cultivation of compassion. Through illuminating dialogues, the Buddha articulates the nature of suffering (Dukkha), the path to cessation (Nirodha), and the steps to enlightenment. The teachings emphasize personal transformation and deep reflection, inspiring practitioners to walk the path with mindfulness and compassion.",
        "resourceTag": "Long Discourses",
        "tags": []
    },
    {
        "name": "en163-3.pdf",
        "title": "Long Discourses (Dīgha Nikāya) - Volume 3",
        "description": "Volume 3 of the Long Discourses (Dīgha Nikāya) brings the collection to a profound conclusion, offering teachings that explore the nature of liberation (Vimutti), the realization of truth (Dhamma), and the attainment of ultimate peace (Nibbāna). The Buddha discusses the conditions for spiritual awakening, the dissolution of ignorance, and the final steps to transcend suffering. These final discourses are a testament to the transformative power of wisdom and compassion, providing a clear map for those seeking the highest truth.",
        "resourceTag": "Long Discourses",
        "tags" : []
    },
    {
        "name": "en54.pdf",
        "title": "VINAYA PITAKA",
        "description": "Vinaya Pitaka introduces the foundational precepts that govern the conduct of Buddhist monks and nuns. This volume outlines the major and minor rules (Pātimokkha), detailing the ethical framework established by the Buddha for the monastic community. Through stories of origin and contextual explanations, the Buddha addresses the importance of discipline, mindfulness, and harmonious living. These teachings not only maintain the purity of the Sangha but also inspire practitioners to cultivate moral integrity and compassion in their daily lives.",
        "resourceTag": "VINAYA PITAKA",
        "tags" : []
    },
    {
        "name": "en166-1.pdf",
        "title": "Numbered Discourses (Aṅguttara Nikāya) - Volume 1",
        "description": "Volume 1 of the Numbered Discourses (Aṅguttara Nikāya), translated by Bhikkhu Sujato, presents the teachings of the Buddha organized by single principles (Ones), pairs (Twos), and sets of three (Threes). This structure provides clear and accessible insights into fundamental Buddhist concepts such as mindfulness, ethical living, and the nature of suffering. Through practical and straightforward discourses, the Buddha offers guidance on how to live a life of compassion, awareness, and inner peace.",
        "resourceTag": "Numbered Discourses",
        "tags" : []
    },
    {
        "name": "en166-2.pdf",
        "title": "Numbered Discourses (Aṅguttara Nikāya) - Volume 2",
        "description": "Volume 2 of the Numbered Discourses (Aṅguttara Nikāya) continues with teachings organized by numerical sets, exploring groups of four (Fours), five (Fives), and six (Sixes). These teachings delve into deeper aspects of the Buddhist path, such as the Four Noble Truths, the Five Aggregates, and the Six Sense Bases. Through these structured teachings, the Buddha guides practitioners on how to cultivate mindfulness, overcome obstacles, and progress toward spiritual liberation.",
        "resourceTag": "Numbered Discourses",
        "tags" : []
    },
    {
        "name": "en166-3.pdf",
        "title": "Numbered Discourses (Aṅguttara Nikāya) - Volume 3",
        "description": "Volume 3 of the Numbered Discourses (Aṅguttara Nikāya) covers sets of seven (Sevens), eight (Eights), and nine (Nines), highlighting the Buddha's teachings on practical wisdom and ethical conduct. This volume emphasizes the Seven Factors of Enlightenment, the Noble Eightfold Path, and the Nine Abodes of Being. Each discourse provides practical steps to deepen one's practice, cultivate inner peace, and achieve greater clarity and understanding on the path to liberation.",
        "resourceTag": "Numbered Discourses",
        "tags" : []
    },
    {
        "name": "en166-4.pdf",
        "title": "Numbered Discourses (Aṅguttara Nikāya) - Volume 4",
        "description": "Volume 4 of the Numbered Discourses (Aṅguttara Nikāya) expands upon the Buddha's teachings, exploring sets of ten (Tens) and eleven (Elevens). These teachings emphasize the Ten Perfections (Pāramitā), the Ten Powers of a Buddha, and the Eleven Benefits of Loving-kindness. Through clear and practical instructions, the Buddha illustrates how to cultivate generosity, patience, and loving-kindness as essential components of the spiritual path, leading to liberation and inner peace.",
        "resourceTag": "Numbered Discourses",
        "tags" : []
    },
    {
        "name": "en166-5.pdf",
        "title": "Numbered Discourses (Aṅguttara Nikāya) - Volume 5",
        "description": "Volume 5 of the Numbered Discourses (Aṅguttara Nikāya) concludes this extensive collection with profound reflections on the practical application of the Buddha's teachings. This volume revisits key principles and expands upon their significance in the pursuit of liberation. Through systematic exploration of numerical lists, practitioners are encouraged to cultivate mindfulness, ethical integrity, and compassionate living. Bhikkhu Sujato’s translation remains faithful to the original Pali texts, offering clarity and accessibility for modern readers.",
        "resourceTag": "Numbered Discourses",
        "tags" : []
    },
    {
        "name": "en165-1.pdf",
        "title": "Linked Discourses (Saṁyutta Nikāya) - Volume 1",
        "description": "Volume 1 of the Linked Discourses (Saṁyutta Nikāya), translated by Bhikkhu Sujato, introduces the foundational concepts of Buddhist practice. This volume explores thematic groups such as the Connected Discourses on the Aggregates (Khandha Saṁyutta), the Elements (Dhātu Saṁyutta), and the Sense Bases (Salāyatana Saṁyutta). Through clear and profound dialogues, the Buddha describes the nature of suffering, impermanence, and the path to liberation, providing practical insights for mindful living.",
        "resourceTag": "Linked Discourses",
        "tags" : []
    },
    {
        "name": "en165-2.pdf",
        "title": "Linked Discourses (Saṁyutta Nikāya) - Volume 2",
        "description": "Volume 2 of the Linked Discourses (Saṁyutta Nikāya) continues the exploration of interconnected teachings, focusing on themes such as Mindfulness of Breathing (Ānāpānasati Saṁyutta), Right View (Diṭṭhi Saṁyutta), and The Path (Magga Saṁyutta). These discourses illuminate the importance of right understanding, meditation, and ethical conduct in overcoming suffering and progressing on the path of awakening.",
        "resourceTag": "Linked Discourses",
        "tags" : []
    },
    {
        "name": "en165-3.pdf",
        "title": "Linked Discourses (Saṁyutta Nikāya) - Volume 3",
        "description": "Volume 3 of the Linked Discourses (Saṁyutta Nikāya) deepens the understanding of core Buddhist principles, exploring the Four Noble Truths (Sacca Saṁyutta), The Noble Eightfold Path (Aṭṭhangika Magga Saṁyutta), and The Five Faculties (Indriya Saṁyutta). These teachings provide clear guidance for cultivating wisdom, ethical living, and spiritual awakening, emphasizing the Buddha's path to the cessation of suffering.",
        "resourceTag": "Linked Discourses",
        "tags" : []
    },
    {
        "name": "en165-4.pdf",
        "title": "Linked Discourses (Saṁyutta Nikāya) - Volume 4",
        "description": "Volume 4 of the Linked Discourses (Saṁyutta Nikāya) explores the Buddha's teachings on Dependent Origination (Paṭiccasamuppāda Saṁyutta), The Powers (Bala Saṁyutta), and The Bases of Spiritual Power (Iddhipāda Saṁyutta). These discourses provide profound insights into the nature of existence, the arising of suffering, and the path to liberation through understanding the chain of dependent conditions.",
        "resourceTag": "Linked Discourses",
        "tags" : []
    },
    {
        "name": "en165-5.pdf",
        "title": "Linked Discourses (Saṁyutta Nikāya) - Volume 5",
        "description": "Volume 5 of the Linked Discourses (Saṁyutta Nikāya) concludes with teachings on The Four Foundations of Mindfulness (Satipaṭṭhāna Saṁyutta), The Seven Factors of Enlightenment (Bojjhaṅga Saṁyutta), and The Brahmavihāras (Divine Abodes). These final discourses emphasize the practice of mindfulness, compassion, and insight as essential tools for realizing true liberation and inner peace.",
        "resourceTag": "Linked Discourses",
        "tags" : []
    },
    {
        "name": "en248.pdf",
        "title": "Basic Passages",
        "description": "The Basic Passages is a collection of fundamental teachings and core verses from the Buddha's discourses. This anthology provides a structured introduction to essential concepts such as mindfulness, ethical living, and the nature of suffering. Through short but profound passages, practitioners are introduced to the foundational principles that guide the path to liberation and inner peace. These concise teachings serve as a practical guide for daily practice, emphasizing clarity, simplicity, and directness in understanding the Dharma.",
        "resourceTag": "Minor Collection",
        "tags" : []
    },
    {
        "name": "en249.pdf",
        "title": "Sayings of the Dhamma",
        "description": "Heartfelt Sayings, also known as the Udāna, is a collection of inspired utterances spoken by the Buddha on significant occasions. Each verse arises from a profound moment of insight or realization, highlighting the Buddha's deep understanding of impermanence, compassion, and liberation. These sayings are not only expressions of wisdom but also reflections on the nature of suffering and the path to its cessation. Practitioners and scholars alike find inspiration and clarity through these heartfelt declarations of truth.",
        "resourceTag": "Minor Collection",
        "tags" : []
    },
    {
        "name": "en250.pdf",
        "title": "Heartfelt Sayings",
        "description": "Heartfelt Sayings, also known as the Udāna, is a collection of inspired utterances spoken by the Buddha on significant occasions. Each verse arises from a profound moment of insight or realization, highlighting the Buddha's deep understanding of impermanence, compassion, and liberation. These sayings are not only expressions of wisdom but also reflections on the nature of suffering and the path to its cessation. Practitioners and scholars alike find inspiration and clarity through these heartfelt declarations of truth.",
        "resourceTag": "Minor Collection",
        "tags" : []
    },
    {
        "name": "en251.pdf",
        "title": "So It Was Said",
        "description": "So It Was Said, known as the Itivuttaka, is a unique collection of short discourses attributed directly to the Buddha. Each teaching begins with the phrase, This was said by the Buddha, followed by practical guidance on the path of mindfulness, virtue, and wisdom. These concise teachings are structured to be easily memorized and reflected upon, providing timeless lessons on ethical living, meditation, and spiritual awakening. The Itivuttaka serves as a bridge between philosophical understanding and practical application in daily life.",
        "resourceTag": "Minor Collection",
        "tags" : []
    },
    {
        "name": "en252.pdf",
        "title": "Anthology of Discourses",
        "description": "The Anthology of Discourses, known as the Sutta Nipāta, is a collection of some of the oldest and most profound teachings attributed to the Buddha. This compilation consists of poetic verses and dialogues that address core themes of compassion, wisdom, and the nature of suffering. The Sutta Nipāta is particularly revered for its simplicity and directness, making the Buddha's teachings accessible to all practitioners. Through vivid storytelling and reflective passages, it guides the reader on a journey toward liberation and inner peace.",
        "resourceTag": "Minor Collection",
        "tags" : []
    },
    {
        "name": "en231-1.pdf",
        "title": "Compendium of States of Phenomena",
        "description": "The Compendium of States of Phenomena, also known as the Dhammasangani, is the first book of the Abhidhamma Pitaka. This work systematically categorizes all mental and physical phenomena, providing a comprehensive analysis of the mind, consciousness, and material existence. It breaks down the components of reality into precise classifications, offering deep insights into how mental states arise, function, and interact. This text serves as a foundation for understanding Buddhist psychology and the nature of perception, leading to a clearer path toward liberation.",
        "resourceTag": "ABHIDHAMMA PITAKA",
        "tags" : []
    } ,
    {
        "name": "en231-2.pdf",
        "title": "Book of Analysis",
        "description": "The Book of Analysis, known as the Vibhaṅga, is the second volume of the Abhidhamma Pitaka. This book provides a detailed analysis of key Buddhist concepts such as the Five Aggregates, Six Sense Bases, and Dependent Origination. Through logical breakdown and examination, it helps practitioners understand the intricate nature of experience and the conditions that give rise to suffering. The Vibhaṅga serves as a critical resource for those studying the mind's workings and the path to enlightenment.",
        "resourceTag": "ABHIDHAMMA PITAKA",
        "tags" : []
    } ,
    {
        "name": "en231-3.pdf",
        "title": "he Discourse on Elements",
        "description": "The Discourse on Elements, or Dhātukathā, is the third text in the Abhidhamma Pitaka. This volume explores the classification and interaction of elements (dhātu), mental factors, and consciousness. Through analytical inquiry, the Buddha's teachings on the nature of reality are dissected to reveal how elements combine and influence human experience. Practitioners use this understanding to cultivate insight and detach from conditioned phenomena.",
        "resourceTag": "ABHIDHAMMA PITAKA",
        "tags" : []
    } ,
    {
        "name": "en231-4.pdf",
        "title": "The Designation of Human Types",
        "description": "The Designation of Human Types, known as the Puggalapaññatti, is the fourth book of the Abhidhamma Pitaka. This text classifies different types of individuals based on their spiritual development, moral qualities, and mental capabilities. By understanding these distinctions, practitioners can better recognize the diversity of spiritual paths and tailor their practice accordingly. This categorization also helps in understanding how karma and mental habits influence human behavior.",
        "resourceTag": "ABHIDHAMMA PITAKA",
        "tags" : []
    } ,
    {
        "name": "en231-5.pdf",
        "title": "The Points of Controversy",
        "description": "The Points of Controversy, also called the Kathāvatthu, is the fifth book of the Abhidhamma Pitaka. This unique text documents debates and discussions on various doctrinal points among different Buddhist schools. Compiled during the reign of King Ashoka, it serves as a critical examination of differing interpretations of the Buddha's teachings. By resolving these doctrinal disputes, the Kathāvatthu reinforces the core principles of the Dharma and clarifies misunderstandings in Buddhist philosophy.",
        "resourceTag": "ABHIDHAMMA PITAKA",
        "tags" : []
    } ,
    {
        "name": "en231-1.pdf",
        "title": "Book of Pairs",
        "description": "The Book of Pairs, known as the Yamaka, is the sixth and final text of the Abhidhamma Pitaka. This volume is structured in a unique question-and-answer format, exploring various aspects of reality, mental states, and causality. By analyzing concepts in pairs—such as mind and matter, cause and effect, and existence and non-existence—the Yamaka encourages deep contemplation and understanding of the Buddha's teachings. Its analytical method helps practitioners develop sharp insight and clarity on the nature of existence.",
        "resourceTag": "ABHIDHAMMA PITAKA",
        "tags" : []
    }
]
