[
  {
    "quote": "Mind precedes all things; mind is their chief.",
    "source": "Dhammapada 1"
  },
  {
    "quote": "If one speaks or acts with a pure mind, happiness follows like a shadow.",
    "source": "Dhammapada 2"
  },
  {
    "quote": "Hatred is never appeased by hatred; by non‑hatred alone is hatred appeased.",
    "source": "Dhammapada 5"
  },
  {
    "quote": "He abused me, he struck me—such thoughts keep hatred alive.",
    "source": "Dhammapada 3"
  },
  {
    "quote": "He abused me, he struck me—abandoning such thoughts, hatred is quenched.",
    "source": "Dhammapada 4"
  },
  {
    "quote": "Like a storm the wind cannot shake a mountain, so blame does not shake the wise.",
    "source": "Dhammapada 81"
  },
  {
    "quote": "Just as a solid rock is not shaken by the storm, the wise are not moved by praise or blame.",
    "source": "Dhammapada 6"
  },
  {
    "quote": "As an irrigator guides water, a fletcher straightens an arrow, the wise shape themselves.",
    "source": "Dhammapada 80"
  },
  {
    "quote": "One truly is one’s own protector; who else could be?",
    "source": "Dhammapada 160"
  },
  {
    "quote": "Better than a thousand hollow words is a single word that brings peace.",
    "source": "Dhammapada 100"
  },
  {
    "quote": "Wakefulness is the path to the deathless; heedlessness is the path to death.",
    "source": "Dhammapada 21"
  },
  {
    "quote": "By effort and heedfulness, by self‑control and restraint, the wise make for an island no flood can overwhelm.",
    "source": "Dhammapada 25"
  },
  {
    "quote": "Conquer anger with non‑anger; conquer the miser with giving; conquer the liar with truth.",
    "source": "Dhammapada 223"
  },
  {
    "quote": "All tremble at violence; all fear death. Comparing oneself with others, one should not kill or cause to kill.",
    "source": "Dhammapada 129–130"
  },
  {
    "quote": "Not by silence does one become a sage if, confused and ignorant, one is still foolish.",
    "source": "Dhammapada 268"
  },
  {
    "quote": "Health is the greatest gift, contentment the greatest wealth, a trusted friend the best relative, Nibbāna the highest bliss.",
    "source": "Dhammapada 204"
  },
  {
    "quote": "Just as a bee gathers nectar and departs without harming the flower, so should the sage live.",
    "source": "Dhammapada 49"
  },
  {
    "quote": "If one holds oneself dear, one should guard oneself well.",
    "source": "Dhammapada 157"
  },
  {
    "quote": "Neither mother, father, nor any other kin can do as much good as a well‑directed mind.",
    "source": "Dhammapada 43"
  },
  {
    "quote": "Even the gods emulate the mindful one who is ever steadfast and pure.",
    "source": "Dhammapada 181"
  },
  {
    "quote": "There is no fire like lust, no grip like hatred, no net like delusion, no river like craving.",
    "source": "Dhammapada 251"
  },
  {
    "quote": "Victory breeds hatred; the defeated live in pain. Happily the peaceful live, giving up victory and defeat.",
    "source": "Dhammapada 201"
  },
  {
    "quote": "From craving springs grief; from craving springs fear. For one free of craving there is no grief—how then fear?",
    "source": "Dhammapada 216"
  },
  {
    "quote": "He who has conquered himself is a far greater hero than he who has conquered a thousand men in battle.",
    "source": "Dhammapada 103"
  },
  {
    "quote": "Not by matted hair, not by lineage, not by birth does one become a brahman; by truth and righteousness one becomes pure.",
    "source": "Dhammapada 393"
  },
  {
    "quote": "The gift of Dhamma surpasses all gifts; the taste of Dhamma surpasses all tastes.",
    "source": "Dhammapada 354"
  },
  {
    "quote": "By oneself is evil done; by oneself one is defiled. By oneself is evil left undone; by oneself one is purified.",
    "source": "Dhammapada 165"
  },
  {
    "quote": "As rain breaks through a poorly thatched hut, so passion enters an undeveloped mind.",
    "source": "Dhammapada 13"
  },
  {
    "quote": "As rain does not penetrate a well‑thatched house, passion does not enter a well‑developed mind.",
    "source": "Dhammapada 14"
  },
  {
    "quote": "Speak only the speech that does not bring remorse and is welcomed by the wise.",
    "source": "Dhammapada 133"
  },
  {
    "quote": "If one finds a prudent companion, let one go with him joyfully and mindfully; if not, walk alone like a king who has left a conquered kingdom.",
    "source": "Dhammapada 328"
  },
  {
    "quote": "A fool sleeps as if already dead; but the master is awake and lives forever.",
    "source": "Dhammapada 21–23"
  },
  {
    "quote": "Do not consider little faults as trivial; a jar is filled by falling drops.",
    "source": "Dhammapada 121"
  },
  {
    "quote": "If one commits no wrong with body, speech, or mind, one has nothing to fear.",
    "source": "Dhammapada 120"
  },
  {
    "quote": "All conditioned things are impermanent—when one sees this with wisdom, one turns away from suffering.",
    "source": "Dhammapada 277"
  },
  {
    "quote": "All conditioned things are suffering—when one sees this with wisdom, one turns away from suffering.",
    "source": "Dhammapada 278"
  },
  {
    "quote": "All phenomena are not‑self—when one sees this with wisdom, one turns away from suffering.",
    "source": "Dhammapada 279"
  },
  {
    "quote": "One should not harm living beings; one should not speak harshly; restraining oneself from killing and speaking truthfully, one should be moderate in food.",
    "source": "Dhammapada 185"
  },
  {
    "quote": "To avoid all evil, to cultivate good, to purify one’s mind—this is the teaching of the Buddhas.",
    "source": "Dhammapada 183"
  },
  {
    "quote": "Enduring patience is the highest austerity; Nibbāna is the supreme, say the Buddhas.",
    "source": "Dhammapada 184"
  },
  {
    "quote": "Like a fish drawn from its watery home, thrown on land, the mind trembles, trying to escape the realm of Māra.",
    "source": "Dhammapada 34"
  },
  {
    "quote": "Difficult is it to find a noble friend; difficult to dwell delighted in seclusion; difficult to bear the faults of others.",
    "source": "Dhammapada 328–330"
  },
  {
    "quote": "He who delights in the Dhamma dwells in happiness with a tranquil mind.",
    "source": "Dhammapada 79"
  },
  {
    "quote": "One is not a wise man because he speaks much; he who is loving, without hate, fearful, or fearless—he is called wise.",
    "source": "Dhammapada 258–259"
  },
  {
    "quote": "Better it is to live alone; there is no companionship with a fool.",
    "source": "Dhammapada 330"
  },
  {
    "quote": "The fragrant odors of sandalwood and tagara travel not against the wind; the scent of the virtuous spreads in all directions.",
    "source": "Dhammapada 54–55"
  },
  {
    "quote": "Few are those who reach the far shore; most people run up and down on this shore.",
    "source": "Dhammapada 85"
  },
  {
    "quote": "Not by rituals and vows, nor by much learning, does one attain peace; but by freedom from lust, hatred, and delusion.",
    "source": "Dhammapada 271–273"
  },
  {
    "quote": "If, like a broken gong, you are silent, you have come to Nibbāna; for no anger is found in you.",
    "source": "Dhammapada 134"
  },
  {
    "quote": "It is easy to see the faults of others, hard to see one’s own.",
    "source": "Dhammapada 252"
  },
  {
    "quote": "As the jasmine sheds its withered flowers, so should one shed passion and hatred.",
    "source": "Dhammapada 377"
  },
  {
    "quote": "The wise abandon the unwholesome and cultivate the wholesome, watching over their minds.",
    "source": "Dhammapada 183–185"
  },
  {
    "quote": "There is no path in the sky; there is no true ascetic outside the Dhamma.",
    "source": "Dhammapada 254"
  },
  {
    "quote": "Even if for a lifetime the fool associates with the wise, he no more knows the Dhamma than a spoon knows the taste of soup.",
    "source": "Dhammapada 64"
  },
  {
    "quote": "Like a beautiful flower, full of color but without scent, is a well‑spoken word that is not acted upon.",
    "source": "Dhammapada 51"
  },
  {
    "quote": "A tamed mind brings happiness.",
    "source": "Dhammapada 35"
  },
  {
    "quote": "Whatever harm an enemy might do to an enemy, a wrongly directed mind can do worse to oneself.",
    "source": "Dhammapada 42"
  },
  {
    "quote": "Guard your mind well; a guarded mind brings happiness.",
    "source": "Dhammapada 36"
  },
  {
    "quote": "If you see a wise person who points out your faults and corrects you, associate with them as with a revealer of treasure.",
    "source": "Dhammapada 76"
  },
  {
    "quote": "One should speak the truth, not be angry, and, when asked, give, even to the least.",
    "source": "Dhammapada 224"
  },
  {
    "quote": "Hunger is the worst illness; conditioned existence the worst suffering. Knowing this as it really is, the wise realize Nibbāna, the highest bliss.",
    "source": "Dhammapada 203"
  },
  {
    "quote": "A man is not a true monk if he harms others; one who harms none is called a monk.",
    "source": "Dhammapada 270"
  },
  {
    "quote": "Abandon anger; discard pride; overcome all fetters. Suffering does not befall one who is passionless and attached to nothing.",
    "source": "Dhammapada 221"
  },
  {
    "quote": "The careless are dead already; the heedful are fully alive.",
    "source": "Dhammapada 21"
  },
  {
    "quote": "Do not neglect your own welfare for the sake of another’s, however great; clearly knowing your own good, pursue the true goal.",
    "source": "Dhammapada 166"
  },
  {
    "quote": "Just as rust eats the iron from which it is produced, so do one’s own deeds lead the negligent to a state of woe.",
    "source": "Dhammapada 240"
  },
  {
    "quote": "A single day lived with virtue and meditation is better than a hundred years lived in idleness and laxity.",
    "source": "Dhammapada 110–112"
  },
  {
    "quote": "The wise are intent on absorption; they delight in the peace of renunciation.",
    "source": "Dhammapada 373"
  },
  {
    "quote": "Few are those who see clearly; many do not.",
    "source": "Dhammapada 174"
  },
  {
    "quote": "If a man does what he should not, he does it to his own loss.",
    "source": "Dhammapada 314"
  },
  {
    "quote": "Even as a mother protects with her life her only child, so with a boundless heart should one cherish all living beings.",
    "source": "Sutta Nipāta 1.8 (Karaṇīya‑mettā)"
  },
  {
    "quote": "Let none deceive another or despise anyone anywhere.",
    "source": "Sutta Nipāta 1.8 (Karaṇīya‑mettā)"
  },
  {
    "quote": "Contentment is the greatest wealth; few desires, the best riches.",
    "source": "Sutta Nipāta 2.4 (Maha‑mangala or Dhaniya themes)"
  },
  {
    "quote": "Not by water are stains removed; only by inner truth is one purified.",
    "source": "Sutta Nipāta 2.4 (Vatthūpama‑like theme)"
  },
  {
    "quote": "Harmlessness to all beings—this is the highest blessing.",
    "source": "Khuddakapāṭha 5 (Maṅgala Sutta)"
  },
  {
    "quote": "Bhikkhus, I say that intention is kamma.",
    "source": "Saṃyutta Nikāya 12.38"
  },
  {
    "quote": "Whatever one frequently thinks and ponders upon, that will become the inclination of the mind.",
    "source": "Majjhima Nikāya 19"
  },
  {
    "quote": "All conditioned things are impermanent—when one sees this with wisdom, one grows disenchanted with suffering; this is the path to purity.",
    "source": "Saṃyutta Nikāya 22.59"
  },
  {
    "quote": "What is impermanent is suffering; what is suffering is non‑self; what is non‑self should be seen as it really is with correct wisdom.",
    "source": "Saṃyutta Nikāya 22.59"
  },
  {
    "quote": "This is suffering; this is the origin of suffering; this is the cessation of suffering; this is the path leading to the cessation of suffering.",
    "source": "Saṃyutta Nikāya 56.11 (Dhammacakkappavattana)"
  },
  {
    "quote": "Whatever is subject to arising is all subject to cessation.",
    "source": "Saṃyutta Nikāya 22.37 / 36.21 (theme)"
  },
  {
    "quote": "With the destruction of craving comes the destruction of suffering.",
    "source": "Saṃyutta Nikāya 12.43–44"
  },
  {
    "quote": "Not by mere vows and austerities, not by much learning, does one attain peace; only by the complete ending of lust.",
    "source": "Saṃyutta Nikāya 1.19 (theme aligned with Dhp 271–273)"
  },
  {
    "quote": "A tamed mind brings happiness like a cool lake in summer.",
    "source": "Saṃyutta Nikāya 1.1–10 (Arañña‑sutta themes)"
  },
  {
    "quote": "Just as the ocean has but one taste, the taste of salt, so too this Dhamma‑Vinaya has but one taste, the taste of liberation.",
    "source": "Saṃyutta Nikāya 55.10"
  },
  {
    "quote": "By protecting oneself, one protects others; by protecting others, one protects oneself.",
    "source": "Saṃyutta Nikāya 47.19"
  },
  {
    "quote": "When a wise person does no evil with body, speech, or mind, he experiences happiness.",
    "source": "Saṃyutta Nikāya 1.13 (Nandana)"
  },
  {
    "quote": "When greed, hate, and delusion are abandoned, the mind becomes pliant, malleable, and bright.",
    "source": "Majjhima Nikāya 3 (Dvedhāvitakka / similar themes)"
  },
  {
    "quote": "Monks, develop mindfulness of breathing; when mindfulness of breathing is developed and cultivated, it is of great fruit and great benefit.",
    "source": "Majjhima Nikāya 118 (Ānāpānasati)"
  },
  {
    "quote": "In whatsoever Dhamma and Discipline the noble eightfold path is found, there is the true ascetic.",
    "source": "Majjhima Nikāya 141 (Saccavibhanga)"
  },
  {
    "quote": "There is the case where a bhikkhu contemplates the body in the body—ardent, fully aware, and mindful.",
    "source": "Majjhima Nikāya 10 (Satipaṭṭhāna)"
  },
  {
    "quote": "Not to do any evil, to cultivate the good, to purify one’s mind—this is the instruction of the Buddhas.",
    "source": "Majjhima Nikāya 14 (echoes Dhp 183)"
  },
  {
    "quote": "By knowing and seeing as they are the five aggregates, one becomes disenchanted and dispassionate.",
    "source": "Majjhima Nikāya 109"
  },
  {
    "quote": "He who sees dependent origination sees the Dhamma; he who sees the Dhamma sees dependent origination.",
    "source": "Majjhima Nikāya 28"
  },
  {
    "quote": "Monks, this mind is radiant, but it is defiled by adventitious defilements.",
    "source": "Aṅguttara Nikāya 1.49–52 (often cited with MN context)"
  },
  {
    "quote": "Whatever is felt is included in suffering.",
    "source": "Majjhima Nikāya 59 / 148 (themes on feeling)"
  },
  {
    "quote": "Do not go by reports, by legends, by traditions, by scripture… When you know for yourselves that these things are unwholesome, abandon them.",
    "source": "Aṅguttara Nikāya 3.65 (Kālāma Sutta)"
  },
  {
    "quote": "There are these three roots of the unwholesome: greed, hatred, and delusion.",
    "source": "Aṅguttara Nikāya 3.69"
  },
  {
    "quote": "There are these three roots of the wholesome: non‑greed, non‑hatred, and non‑delusion.",
    "source": "Aṅguttara Nikāya 3.69"
  },
  {
    "quote": "There are these four right efforts: to prevent, to abandon, to develop, to maintain.",
    "source": "Aṅguttara Nikāya 4.13"
  },
  {
    "quote": "These four ways of dealing with others: giving, kindly speech, beneficial conduct, impartiality.",
    "source": "Aṅguttara Nikāya 4.32"
  },
  {
    "quote": "There are these five obstacles: sensual desire, ill will, dullness‑drowsiness, restlessness‑remorse, and doubt.",
    "source": "Aṅguttara Nikāya 5.51"
  },
  {
    "quote": "These five precepts lead to welfare and happiness for long time.",
    "source": "Aṅguttara Nikāya 8.39 / 5‑precept teachings"
  },
  {
    "quote": "Associate with the wise; avoid the foolish; honor the honorable.",
    "source": "Aṅguttara Nikāya 3.23"
  },
  {
    "quote": "There are these six recollections: the Buddha, the Dhamma, the Saṅgha, virtue, generosity, and the devas.",
    "source": "Aṅguttara Nikāya 6.10"
  },
  {
    "quote": "The Dhamma is visible here and now, timeless, inviting inspection, leading onward, to be experienced individually by the wise.",
    "source": "Aṅguttara Nikāya 3.55"
  },
  {
    "quote": "There is, monks, an unborn, unbecome, unmade, uncompounded. Were there not, no escape from the born, become, made, compounded would be discerned.",
    "source": "Udāna 8.3"
  },
  {
    "quote": "With the change of conditions there is change of elements.",
    "source": "Udāna 1.1 (or 4.1 thematic)"
  },
  {
    "quote": "Just as a flame is blown out by the wind, so the mind is calmed by the rightly developed path.",
    "source": "Udāna 4.1 (Nibbāna themes)"
  },
  {
    "quote": "Whatever is subject to arising is subject to cessation—having known this, the Tathāgata teaches the Dhamma.",
    "source": "Itivuttaka 49"
  },
  {
    "quote": "Give, monks, for giving is praised; the gift of Dhamma surpasses all gifts.",
    "source": "Itivuttaka 98 / Dhp 354 theme"
  },
  {
    "quote": "As a border town well guarded within and without, so guard yourself.",
    "source": "Dhammapada 315"
  },
  {
    "quote": "Do not give your mind to the delights of others; rather, guard your own well‑being.",
    "source": "Dhammapada 166"
  },
  {
    "quote": "If while on the way you meet no one your equal or better, travel alone.",
    "source": "Dhammapada 61"
  },
  {
    "quote": "The wise do not hurt others; they are restrained by virtue and freed by wisdom.",
    "source": "Dhammapada 270–271"
  },
  {
    "quote": "A single day lived seeing the arising and passing of things is better than a hundred years not seeing this.",
    "source": "Dhammapada 113"
  },
  {
    "quote": "One should not disregard one’s own welfare for another’s, however great.",
    "source": "Dhammapada 166"
  },
  {
    "quote": "From wholesome conduct comes happiness; from unwholesome, suffering.",
    "source": "Dhammapada 120–122"
  },
  {
    "quote": "Not by birth is one an outcast; by deeds one is an outcast.",
    "source": "Dhammapada 393–396"
  },
  {
    "quote": "The wise, ever meditative, do not delight in sense pleasures.",
    "source": "Dhammapada 99"
  },
  {
    "quote": "Whoever destroys life, speaks false, takes what is not given, goes to another’s partner, and indulges in intoxicants digs up his own root.",
    "source": "Dhammapada 246–247"
  },
  {
    "quote": "Restraint in body is good; restraint in speech is good; restraint in mind is good; restraint everywhere is good.",
    "source": "Dhammapada 361–363"
  },
  {
    "quote": "Few cross to the far shore; the rest only run up and down the bank.",
    "source": "Dhammapada 85–86"
  },
  {
    "quote": "The wise are tranquil, without attachment, having understood the true path.",
    "source": "Dhammapada 92–93"
  },
  {
    "quote": "There is no satisfying sensual desires, even with a shower of gold.",
    "source": "Dhammapada 186–187"
  },
  {
    "quote": "Better than lordship over the earth is going to the refuge of the Buddha.",
    "source": "Dhammapada 190–192"
  },
  {
    "quote": "Who sees the Dhamma sees me; who sees me sees the Dhamma.",
    "source": "Saṃyutta Nikāya 22.87"
  },
  {
    "quote": "Monks, abandon what is unwholesome; it is possible to abandon the unwholesome.",
    "source": "Aṅguttara Nikāya 2.19"
  },
  {
    "quote": "Guarding the sense‑doors, moderate in eating, devoted to wakefulness—this is the path to peace.",
    "source": "Majjhima Nikāya 2 / 39 themes"
  },
  {
    "quote": "Whatever ascetics or brahmans remember their past lives, all do so through mindfulness and clear comprehension.",
    "source": "Dīgha Nikāya 1–2 themes"
  },
  {
    "quote": "In this very fathom‑long body are the world, the origin of the world, the cessation of the world, and the way leading to the cessation of the world.",
    "source": "Saṃyutta Nikāya 2.26"
  }
]